Documents/Покупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Покупка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиКотятВКоробках</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьКотят</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коробка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Коробки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Породы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Покупка/Ext/ManagerModule.bsl
Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Покупка.Ссылка КАК Ссылка ИЗ Документ.Покупка КАК Покупка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйДокумент = Документы.Покупка.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.10');
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Бобтейл");
	НоваяСтрока.Цена = 50;
	НоваяСтрока.Количество = 2;
	НоваяСтрока.Сумма = 100;
	
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Британец");
	НоваяСтрока.Цена = 100;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = 100;
	
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("2");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Британец");
	НоваяСтрока.Цена = 100;
	НоваяСтрока.Количество = 2;
	НоваяСтрока.Сумма = 100; 
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
